result/usenix/run3/results-prctl12-12/benchmark-stats.log
  240000000 requests completed in 465.59 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
1.18% <= 2 milliseconds
44.59% <= 3 milliseconds
73.45% <= 4 milliseconds
81.40% <= 5 milliseconds
86.59% <= 6 milliseconds
90.75% <= 7 milliseconds
93.82% <= 8 milliseconds
96.29% <= 9 milliseconds
97.31% <= 10 milliseconds
97.91% <= 11 milliseconds
98.27% <= 12 milliseconds
98.62% <= 13 milliseconds
98.84% <= 14 milliseconds
98.96% <= 15 milliseconds
99.03% <= 16 milliseconds
99.09% <= 17 milliseconds
99.15% <= 18 milliseconds
99.19% <= 19 milliseconds
99.23% <= 20 milliseconds
99.27% <= 21 milliseconds
99.31% <= 22 milliseconds
99.34% <= 23 milliseconds
99.37% <= 24 milliseconds
99.40% <= 25 milliseconds
99.43% <= 26 milliseconds
99.45% <= 27 milliseconds
99.48% <= 28 milliseconds
99.50% <= 29 milliseconds
99.52% <= 30 milliseconds
99.54% <= 31 milliseconds
99.56% <= 32 milliseconds
99.57% <= 33 milliseconds
99.59% <= 34 milliseconds
99.61% <= 35 milliseconds
99.62% <= 36 milliseconds
99.64% <= 37 milliseconds
99.65% <= 38 milliseconds
99.66% <= 39 milliseconds
99.68% <= 40 milliseconds
99.69% <= 41 milliseconds
99.70% <= 42 milliseconds
99.71% <= 43 milliseconds
99.72% <= 44 milliseconds
99.73% <= 45 milliseconds
99.73% <= 46 milliseconds
99.74% <= 47 milliseconds
99.75% <= 48 milliseconds
99.76% <= 49 milliseconds
99.77% <= 50 milliseconds
99.78% <= 51 milliseconds
99.79% <= 52 milliseconds
99.79% <= 53 milliseconds
99.80% <= 54 milliseconds
99.81% <= 55 milliseconds
99.82% <= 56 milliseconds
99.83% <= 57 milliseconds
99.83% <= 58 milliseconds
99.84% <= 59 milliseconds
99.85% <= 60 milliseconds
99.85% <= 61 milliseconds
99.86% <= 62 milliseconds
99.86% <= 63 milliseconds
99.87% <= 64 milliseconds
99.87% <= 65 milliseconds
99.88% <= 66 milliseconds
99.88% <= 67 milliseconds
99.89% <= 68 milliseconds
99.89% <= 69 milliseconds
99.90% <= 70 milliseconds
99.90% <= 71 milliseconds
99.90% <= 72 milliseconds
99.91% <= 73 milliseconds
99.91% <= 74 milliseconds
99.91% <= 75 milliseconds
99.91% <= 76 milliseconds
99.92% <= 77 milliseconds
99.92% <= 78 milliseconds
99.92% <= 79 milliseconds
99.92% <= 80 milliseconds
99.92% <= 81 milliseconds
99.92% <= 82 milliseconds
99.92% <= 83 milliseconds
99.92% <= 84 milliseconds
99.92% <= 85 milliseconds
99.93% <= 86 milliseconds
99.93% <= 87 milliseconds
99.93% <= 88 milliseconds
99.93% <= 89 milliseconds
99.93% <= 90 milliseconds
99.93% <= 91 milliseconds
99.93% <= 92 milliseconds
99.93% <= 93 milliseconds
99.93% <= 94 milliseconds
99.93% <= 95 milliseconds
99.93% <= 96 milliseconds
99.93% <= 97 milliseconds
99.93% <= 98 milliseconds
99.93% <= 99 milliseconds
99.93% <= 100 milliseconds
99.93% <= 101 milliseconds
99.93% <= 102 milliseconds
99.93% <= 103 milliseconds
99.93% <= 104 milliseconds
99.93% <= 105 milliseconds
99.93% <= 106 milliseconds
99.93% <= 107 milliseconds
99.93% <= 108 milliseconds
99.93% <= 109 milliseconds
99.93% <= 110 milliseconds
99.93% <= 111 milliseconds
99.93% <= 112 milliseconds
99.93% <= 113 milliseconds
99.93% <= 114 milliseconds
99.93% <= 115 milliseconds
99.93% <= 116 milliseconds
99.93% <= 117 milliseconds
99.93% <= 118 milliseconds
99.93% <= 119 milliseconds
99.93% <= 120 milliseconds
99.93% <= 121 milliseconds
99.93% <= 122 milliseconds
99.93% <= 126 milliseconds
99.93% <= 127 milliseconds
99.93% <= 128 milliseconds
99.93% <= 129 milliseconds
99.93% <= 131 milliseconds
99.93% <= 132 milliseconds
99.93% <= 133 milliseconds
99.93% <= 135 milliseconds
99.93% <= 138 milliseconds
99.93% <= 139 milliseconds
99.93% <= 140 milliseconds
99.93% <= 144 milliseconds
99.93% <= 149 milliseconds
99.93% <= 154 milliseconds
99.93% <= 158 milliseconds
99.93% <= 162 milliseconds
99.93% <= 163 milliseconds
99.93% <= 167 milliseconds
99.93% <= 173 milliseconds
99.93% <= 174 milliseconds
99.93% <= 181 milliseconds
99.93% <= 182 milliseconds
99.93% <= 190 milliseconds
99.93% <= 193 milliseconds
99.93% <= 195 milliseconds
99.93% <= 198 milliseconds
99.93% <= 200 milliseconds
99.93% <= 202 milliseconds
99.93% <= 203 milliseconds
99.93% <= 208 milliseconds
99.93% <= 213 milliseconds
99.93% <= 216 milliseconds
99.93% <= 220 milliseconds
99.93% <= 225 milliseconds
99.93% <= 227 milliseconds
99.93% <= 230 milliseconds
99.93% <= 231 milliseconds
99.93% <= 233 milliseconds
99.93% <= 234 milliseconds
99.93% <= 236 milliseconds
99.93% <= 237 milliseconds
99.93% <= 240 milliseconds
99.93% <= 254 milliseconds
99.93% <= 281 milliseconds
99.93% <= 292 milliseconds
99.93% <= 301 milliseconds
99.93% <= 304 milliseconds
99.93% <= 310 milliseconds
99.93% <= 315 milliseconds
99.93% <= 319 milliseconds
99.93% <= 338 milliseconds
99.93% <= 354 milliseconds
99.93% <= 362 milliseconds
99.93% <= 364 milliseconds
99.93% <= 365 milliseconds
99.94% <= 371 milliseconds
99.94% <= 823 milliseconds
99.94% <= 824 milliseconds
99.94% <= 826 milliseconds
99.94% <= 829 milliseconds
99.94% <= 831 milliseconds
99.94% <= 896 milliseconds
99.94% <= 897 milliseconds
99.94% <= 898 milliseconds
99.94% <= 900 milliseconds
99.94% <= 901 milliseconds
99.94% <= 902 milliseconds
99.94% <= 906 milliseconds
99.94% <= 914 milliseconds
99.94% <= 915 milliseconds
99.94% <= 916 milliseconds
99.94% <= 917 milliseconds
99.94% <= 918 milliseconds
99.94% <= 920 milliseconds
99.94% <= 921 milliseconds
99.94% <= 923 milliseconds
99.94% <= 925 milliseconds
99.94% <= 926 milliseconds
99.94% <= 928 milliseconds
99.94% <= 929 milliseconds
99.94% <= 930 milliseconds
99.94% <= 931 milliseconds
99.94% <= 932 milliseconds
99.94% <= 933 milliseconds
99.94% <= 934 milliseconds
99.94% <= 935 milliseconds
99.94% <= 936 milliseconds
99.94% <= 937 milliseconds
99.94% <= 938 milliseconds
99.94% <= 939 milliseconds
99.94% <= 940 milliseconds
99.94% <= 941 milliseconds
99.94% <= 942 milliseconds
99.94% <= 943 milliseconds
99.94% <= 944 milliseconds
99.94% <= 946 milliseconds
99.94% <= 949 milliseconds
99.94% <= 950 milliseconds
99.95% <= 951 milliseconds
99.95% <= 952 milliseconds
99.95% <= 953 milliseconds
99.95% <= 954 milliseconds
99.95% <= 955 milliseconds
99.95% <= 956 milliseconds
99.95% <= 957 milliseconds
99.96% <= 958 milliseconds
99.96% <= 959 milliseconds
99.96% <= 960 milliseconds
99.96% <= 961 milliseconds
99.96% <= 962 milliseconds
99.96% <= 964 milliseconds
99.96% <= 967 milliseconds
99.96% <= 968 milliseconds
99.96% <= 969 milliseconds
99.96% <= 970 milliseconds
99.96% <= 971 milliseconds
99.96% <= 972 milliseconds
99.96% <= 973 milliseconds
99.96% <= 974 milliseconds
99.97% <= 975 milliseconds
99.97% <= 976 milliseconds
99.97% <= 977 milliseconds
99.97% <= 978 milliseconds
99.97% <= 979 milliseconds
99.97% <= 980 milliseconds
99.97% <= 981 milliseconds
99.97% <= 982 milliseconds
99.97% <= 983 milliseconds
99.98% <= 984 milliseconds
99.98% <= 985 milliseconds
99.98% <= 986 milliseconds
99.98% <= 987 milliseconds
99.98% <= 988 milliseconds
99.98% <= 989 milliseconds
99.98% <= 990 milliseconds
99.98% <= 991 milliseconds
99.98% <= 992 milliseconds
99.98% <= 993 milliseconds
99.98% <= 994 milliseconds
99.99% <= 995 milliseconds
99.99% <= 996 milliseconds
99.99% <= 997 milliseconds
99.99% <= 998 milliseconds
99.99% <= 999 milliseconds
99.99% <= 1000 milliseconds
99.99% <= 1001 milliseconds
99.99% <= 1002 milliseconds
99.99% <= 1003 milliseconds
99.99% <= 1004 milliseconds
99.99% <= 1005 milliseconds
99.99% <= 1006 milliseconds
99.99% <= 1007 milliseconds
99.99% <= 1008 milliseconds
99.99% <= 1009 milliseconds
99.99% <= 1010 milliseconds
99.99% <= 1011 milliseconds
99.99% <= 1012 milliseconds
99.99% <= 1013 milliseconds
99.99% <= 1014 milliseconds
99.99% <= 1015 milliseconds
99.99% <= 1016 milliseconds
99.99% <= 1017 milliseconds
99.99% <= 1019 milliseconds
99.99% <= 1020 milliseconds
99.99% <= 1021 milliseconds
99.99% <= 1022 milliseconds
99.99% <= 1023 milliseconds
99.99% <= 1026 milliseconds
99.99% <= 1027 milliseconds
99.99% <= 1028 milliseconds
99.99% <= 1031 milliseconds
99.99% <= 1032 milliseconds
99.99% <= 1033 milliseconds
99.99% <= 1034 milliseconds
99.99% <= 1035 milliseconds
99.99% <= 1036 milliseconds
99.99% <= 1037 milliseconds
99.99% <= 1038 milliseconds
99.99% <= 1039 milliseconds
99.99% <= 1041 milliseconds
99.99% <= 1042 milliseconds
99.99% <= 1043 milliseconds
99.99% <= 1044 milliseconds
100.00% <= 1046 milliseconds
100.00% <= 1047 milliseconds
100.00% <= 1048 milliseconds
100.00% <= 1050 milliseconds
100.00% <= 1051 milliseconds
100.00% <= 1052 milliseconds
100.00% <= 1053 milliseconds
100.00% <= 1054 milliseconds
100.00% <= 1055 milliseconds
100.00% <= 1059 milliseconds
100.00% <= 1061 milliseconds
100.00% <= 1064 milliseconds
100.00% <= 1066 milliseconds
100.00% <= 1070 milliseconds
100.00% <= 1084 milliseconds
100.00% <= 1087 milliseconds
100.00% <= 1089 milliseconds
100.00% <= 1911 milliseconds
100.00% <= 1961 milliseconds
100.00% <= 1962 milliseconds
100.00% <= 1992 milliseconds
100.00% <= 1993 milliseconds
100.00% <= 1995 milliseconds
100.00% <= 1996 milliseconds
100.00% <= 1997 milliseconds
100.00% <= 1998 milliseconds
100.00% <= 1999 milliseconds
100.00% <= 2000 milliseconds
100.00% <= 2003 milliseconds
100.00% <= 2004 milliseconds
100.00% <= 2005 milliseconds
100.00% <= 2006 milliseconds
100.00% <= 2007 milliseconds
100.00% <= 2009 milliseconds
100.00% <= 2011 milliseconds
100.00% <= 2014 milliseconds
100.00% <= 2040 milliseconds
100.00% <= 2049 milliseconds
100.00% <= 2053 milliseconds
100.00% <= 2055 milliseconds
100.00% <= 2912 milliseconds
100.00% <= 2913 milliseconds
100.00% <= 2915 milliseconds
100.00% <= 2964 milliseconds
100.00% <= 2965 milliseconds
100.00% <= 3038 milliseconds
100.00% <= 3038 milliseconds
515478.31 requests per second